app/controllers/schoolclasses_controller.rb

SELECT "schoolclasses".* FROM "schoolclasses"
---
  def index
    @schoolclasses = Schoolclass.all

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @schoolclass = Schoolclass.find(params[:id])

INSERT INTO "schoolclasses" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "History"], ["room_number", 405], ["created_at", "2017-12-19 21:36:00.260830"], ["updated_at", "2017-12-19 21:36:00.260830"]]
---
  def create
    @schoolclass = Schoolclass.new(schoolclass_params(:title, :room_number))

    if @schoolclass.save

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @schoolclass = Schoolclass.find(params[:id])

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "schoolclasses" SET "room_number" = ?, "updated_at" = ? WHERE "schoolclasses"."id" = ?  [["room_number", 0], ["updated_at", "2017-12-19 22:24:58.312496"], ["id", 3]]
---
  def update
    @schoolclass = Schoolclass.find(params[:id])
    @schoolclass.update(schoolclass_params(:title, :room_number))