app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params(:first_name, :last_name))

    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-12-19 01:50:43.585212"], ["updated_at", "2017-12-19 01:50:43.585212"]]